[
  {
    "id": "b9e2f73a-4557-4b37-a9a6-8eed15171038",
    "title": "Took a break on project",
    "date": "2024-01-14",
    "blocks": [
      {
        "component": "paragraph",
        "text": "Didn’t go to the lab for project work for I was busy flying kites :)"
      },
      {
        "component": "paragraph",
        "text": "Leetcode"
      },
      {
        "component": "bulleted_list_item",
        "text": "P394; medium ; 2hr+ ;stacks; saw solution; this problem sucked me inside out. Happy that I did it finally."
      },
      {
        "component": "bulleted_list_item",
        "text": "P328; medium; don’t ask; linked list; saw solution, taking awful lot of time in these newer topics."
      },
      {
        "component": "bulleted_list_item",
        "text": "P649;medium;40:08;queue; saw solution, very new problem and solution logic."
      },
      {
        "component": "bulleted_list_item",
        "text": "P933;easy;5:02;queue"
      }
    ]
  },
  {
    "id": "f884bf34-b6b3-468e-880d-73e65228b6a0",
    "title": "Finally there’s motion in the project",
    "date": "2024-01-13",
    "blocks": [
      {
        "component": "paragraph",
        "text": "After commiting plenty of rookie mistakes we finally managed to establish a tcp connection with the phase measurement unit and received its config files. "
      },
      {
        "component": "paragraph",
        "text": "In the beginning we were thinking that the PMU is a client and it is sending out requests to connect to server to send data, I know it sounds stupid now but we were not given any port that should have suggested us the alternate. Till yesterday we were thinking okay now that it is a server, after connecting to it why the hell is it not sending any data. Finally today while going through the documentation of IEEE C37.118 protocol I came to understand the basic flaw in our approach."
      },
      {
        "component": "paragraph",
        "text": "For any communication to start be whatever the protocol there should be a command frame sent by the client to initiate the conversation. I’ve read it in the course on IOT but boy am I not stupid enough to ignore it while implementing and waste time😭. Finally sent a demo command frame according to the docs and voilla we had the gibberish of a config response. Have to decode that piece tomorrow and then we’ll start receiving the phase data."
      },
      {
        "component": "paragraph",
        "text": "Leetcode"
      },
      {
        "component": "bulleted_list_item",
        "text": "P394, Medium , Stacks, 1:30:12, unsolved as of now because I read the question wrong. Will do it tomorrow again."
      },
      {
        "component": "bulleted_list_item",
        "text": "P206, Easy, 20:40, Reverse linked list."
      },
      {
        "component": "bulleted_list_item",
        "text": "P2095, Medium, 23:12, Delete middle in linked list"
      },
      {
        "component": "bulleted_list_item",
        "text": "P2130, Medium , did using vectors to save time and streak, will do it the right way tomorrow."
      },
      {
        "component": "bulleted_list_item",
        "text": "P372, Easy , did easy binary search question to save time as it is 4:44 AM and I am trying to finish 4 questions for today and save my streak as new day for Leetcode starts at 5:30 AM in India. Had I not misread P394 I would have finished my problems by the evening itself."
      }
    ]
  },
  {
    "id": "d0c1dc83-5f91-456b-a399-e403a263fb54",
    "title": "Little progress with PDC software.",
    "date": "2024-01-12",
    "blocks": [
      {
        "component": "paragraph",
        "text": "Did today’s share of leetcode."
      },
      {
        "component": "bulleted_list_item",
        "text": "P724,easy, 17:37"
      },
      {
        "component": "bulleted_list_item",
        "text": "P2352,medium,22:43, thought my naive approach will tle but it didn’t, though it is kinda slow. Have to see a more optimized solution. Turns out you can compare two vectors easily using maps."
      },
      {
        "component": "bulleted_list_item",
        "text": "P2390; medium; 12:42, Following are some notes : It gave TLE in the first try."
      },
      {
        "component": "numbered_list_item",
        "text": "The reason why using ans.push_back(st.top()) and reversing the string before returning it works fine, while using ans = st.top() + ans results in TLE, is because the + operator for strings is an expensive operation."
      },
      {
        "component": "numbered_list_item",
        "text": "When you use ans = st.top() + ans, for every iteration of the while loop, you are creating a new string by concatenating the current character with the existing string. This new string is then assigned to the ans variable. As the size of the string increases, this operation becomes increasingly expensive, resulting in a TLE for larger inputs."
      },
      {
        "component": "bulleted_list_item",
        "text": "P735; medium; 49:48; solved with soln; was an easy question my logic was also correct but i could not implement it on time I was exhausted."
      },
      {
        "component": "paragraph",
        "text": "Progress in DEP project is really slow, I connected my pc to the PMU server though could not get any buffer or configuration file after connection, the code stopped at recv function everytime. This makes me wonder what if the machine is not sending any data packets in the first place."
      }
    ]
  },
  {
    "id": "0365293f-568e-4123-9095-110530080a0d",
    "title": "did 6 problems today",
    "date": "2024-01-11",
    "blocks": [
      {
        "component": "bulleted_list_item",
        "text": "P1456, medium, 10:04, repetition of max subarr"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1004, medium, 1:22:23, took a lot of time because I had developed my own logic but turned out it was ignorant of many corner cases so wasted a lot of time and finally solved with the solution."
      },
      {
        "component": "bulleted_list_item",
        "text": "P1493, medium , 3:27, special case of P1004"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1732, easy , 5:43, prefix sum "
      },
      {
        "component": "bulleted_list_item",
        "text": "P2215, easy, 26:55, learned the syntax of sets and maps"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1207, easy , 5:15"
      },
      {
        "component": "paragraph",
        "text": "learned about winsock today, to make a client you do not need to do any logic part there is mostly copy pasting of code from the docs or web as there is nothing new to do just follow the instructions. I guess I will start getting the data from PMU by tommorrow."
      }
    ]
  },
  {
    "id": "fcb56e55-4754-4dfa-bf6e-ae9472371784",
    "title": "Started a study plan on leetcode for blind 75",
    "date": "2024-01-10",
    "blocks": [
      {
        "component": "paragraph",
        "text": "solved 4 problems today :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P392, easy, 5:54"
      },
      {
        "component": "bulleted_list_item",
        "text": "P11 container with most water, medium, 22:28"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1679 max number of k sums, medium, 20:21"
      },
      {
        "component": "bulleted_list_item",
        "text": "P643 maximum avg subarray, easy, 1:06:24 , took a while to get the concept of sliding window in my head."
      },
      {
        "component": "paragraph",
        "text": "Tried doing some work on my DEP project but nothing significant came out of todays work."
      }
    ]
  },
  {
    "id": "da7e3de6-7490-4eab-9d24-8784a43e3b5c",
    "title": "Solved 4 problems today",
    "date": "2024-01-09",
    "blocks": [
      {
        "component": "paragraph",
        "text": "Wanted do more as punishment but currently I am too slow."
      },
      {
        "component": "bulleted_list_item",
        "text": "P283, easy, couldn’t solve had to watch the soln."
      },
      {
        "component": "bulleted_list_item",
        "text": "P238, medium, again couldn’t solve, had to see the solution while i did the code myself i was still stuck as i was not counting for the time complexity of the inbuilt function of insert in cpp."
      },
      {
        "component": "bulleted_list_item",
        "text": "P334,medium,solution"
      },
      {
        "component": "bulleted_list_item",
        "text": "P443,string compression, Medium. Wasted a lot of time as i could not figure out how what was happening at the boundary of chars vector."
      }
    ]
  },
  {
    "id": "9fad17da-8758-482e-b0d2-88745541b661",
    "title": "Started Socket Programming in C++",
    "date": "2024-01-07",
    "blocks": [
      {
        "component": "paragraph",
        "text": "Sockets are like pointers but for traversing networks. When you start a socket you are returned an integer that you can use to start communication between a server and client. "
      },
      {
        "component": "paragraph",
        "text": "There are two types of sockets"
      },
      {
        "component": "bulleted_list_item",
        "text": "Socket stream - meant for reliable connections and data integrity. Protocols used are TCP/IP (Transmission control protocol)"
      },
      {
        "component": "bulleted_list_item",
        "text": "Datagram socket - meant for speedy and unreliable connections, used in cases where some data loss is acceptable. Protocol used is UDP(user datagram protocol)."
      },
      {
        "component": "paragraph",
        "text": "Tried writing some code as well to start a basic server but could not figure out how to include winsock_32 something dll in vs code ig vs studio is required."
      },
      {
        "component": "paragraph",
        "text": "did not do much of the grind today, solved the problem151 I had left yesterday. It was about reversing the words in a string. Used two pointer method, had to watch the solutions though."
      }
    ]
  },
  {
    "id": "574750e7-acba-43f6-a482-f8ba44e05bad",
    "title": "Started Leetcode 75",
    "date": "2024-01-06",
    "blocks": [
      {
        "component": "paragraph",
        "text": "solving problems on strings"
      },
      {
        "component": "bulleted_list_item",
        "text": "p1768, easy, 12:05"
      },
      {
        "component": "bulleted_list_item",
        "text": "p1071, easy, 24:12"
      },
      {
        "component": "bulleted_list_item",
        "text": "p1431, easy, 5:01"
      },
      {
        "component": "bulleted_list_item",
        "text": "p605,easy moderate, 32:48 ; good question, 3 pointer "
      },
      {
        "component": "bulleted_list_item",
        "text": "p345, easy, 7:08"
      },
      {
        "component": "bulleted_list_item",
        "text": "p151, medium , 21 + 8 minute spent will do this again couldn’t solve it."
      },
      {
        "component": "paragraph",
        "text": "Gave the div 4 contest on codeforces solved only 2 problems. Was bad but anyways you need to start somewhere."
      }
    ]
  },
  {
    "id": "b9c17e82-36c4-44bd-be7c-cac039a58163",
    "title": "Starting Learning in Public",
    "date": "2024-01-05",
    "blocks": [
      {
        "component": "paragraph",
        "text": "Fixed many bugs that were present in this blogs page and hooked it up with notion API, HENCE we’ll be having daily updates on what I am learning."
      },
      {
        "component": "paragraph",
        "text": "Had in mind to restart that leetcode grind today, but all my time went into fixing this page. Learned some stuff about how Notion API works, every page is divided into its metadata and content. Content is the parent of several blocks of different types of component i.e. paragraphs, codes, numbered item lists, bulleted item lists and so on. "
      },
      {
        "component": "paragraph",
        "text": "Retrieving the data was the easy part just create a integration on the dev page and put in the your client secret in the getting started code. The real headache was formatting the data of this page. Fortunately I found this <a href = https://youtu.be/97ARQTHyf1c?si=zJNKNztjMbsK6bMG>guy</a> , my man helped a lot, Thanks Sean. I guess that’s all I learned today.  "
      },
      {
        "component": "paragraph",
        "text": "Cheers to the new beginning."
      }
    ]
  },
  {
    "id": "853eef81-0a9c-46fa-a646-bd0805893a0a",
    "title": "How does this website work",
    "date": "2023-06-06",
    "blocks": [
      {
        "component": "paragraph",
        "text": "In January, I began drafting this article, and now, in July 2023, I realize I've been delaying its completion for quite some time. However, it's important to clarify that my procrastination wasn't centered around the article itself. Instead, it was due to the limited time I had available to address minor bugs in the Preact.js framework."
      },
      {
        "component": "paragraph",
        "text": "Speaking about the website, it operates on the Javascript library that I have developed. It functions as a single-page application with frontend hash routing, altering the URL with different hashes corresponding to various pages. When I deploy the website on a free-tier Platform as a Service (PaaS), it restricts direct access to other routes, making only the default route accessible through URL search and as I don’t have root access to these servers I had to opt for hash routing."
      },
      {
        "component": "paragraph",
        "text": "Not having an easy access to reliable servers for free meant no database and dynamic content on the website, to solve this I had to come up with some innovative solution to have a database that was convenient to update and tagged along with an API. I used google sheets for the projects and books I’ve read page. The data I maintain on the sheet is then hardcoded into the website repository using a Node.js-based automation script i wrote called gitcron. The script commits the changes in sheet on my behalf everytime I start my laptop. "
      },
      {
        "component": "paragraph",
        "text": "Google sheets wasn’t a good choice for a CMS for blogposts and learning in public updates, So I chose Notion for this and hooked it up with the same script to update the website content."
      },
      {
        "component": "paragraph",
        "text": "Flow of the Website"
      },
      {
        "component": "bulleted_list_item",
        "text": "You visit any domain pointing to this website; currently, it's https://arpitverma.vercel.app"
      },
      {
        "component": "bulleted_list_item",
        "text": "The remote server responds with an index.html and some JavaScript files that get stored in your browser's session storage."
      },
      {
        "component": "bulleted_list_item",
        "text": "Now according to the route you are on in the website corresponding content is fetched from the stored javascript files."
      },
      {
        "component": "bulleted_list_item",
        "text": "These javascript files place the stored html into the virtual-dom element in the index.html "
      },
      {
        "component": "bulleted_list_item",
        "text": "The logic and dynamic aspects of the page are implemented separately. As JavaScript stored in session storage cannot perform logic functions, it's used solely to call upon variables."
      },
      {
        "component": "bulleted_list_item",
        "text": "For the logic part, when a page is called, a corresponding logic script is injected in the index.html."
      }
    ]
  }
]