[
  {
    "id": "1e7e9933-5fca-81bd-8292-e7dca0500e5e",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "2D DP",
    "date": "2024-05-20",
    "description": [
      {
        "component": "paragraph",
        "text": "LC :"
      },
      {
        "component": "bulleted_list_item",
        "text": "62. Unique Paths | Medium/Easy | 2D DP | had solved it idk when using a  combinatorical approach , used dp with 2d memmoization this time."
      },
      {
        "component": "bulleted_list_item",
        "text": "1143. Longest Common Subsequence | Medium | 2D DP | my solution exceeded the memmory limit🫠 |   watched solution"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8157-aad7-da891db1f548",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "DSA grind",
    "date": "2024-10-02",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "https://leetcode.com/problems/vertical-order-traversal-of-a-binary-tree/description/"
      },
      {
        "component": "bulleted_list_item",
        "text": "https://leetcode.com/problems/maximum-width-of-binary-tree/description/"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8150-8a40-c845f151a78a",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Update",
    "date": "2024-03-25",
    "description": [
      {
        "component": "paragraph",
        "text": "Roughly a month now for the last post. Well I was busy with some personal commitments and will be busy for a while so I guess there will be fewer posts for a while. Some update regarding the PDC software I was working on, The backend part of the software is completed. It was a hassle to figure out that you needed to synchronise threads :) didn’t know it before and had to break my head figuring it out. Then after that it was MySQL connector in cpp damn vscode it had to give up at the end of the project??!  It could not link the sql libraries and we had to finally shift to Visual Studio, I feel it is somewhat of a downgrade from VS code, just my personal opinion."
      },
      {
        "component": "paragraph",
        "text": "About DSA I will be doing it in a while but currently don’t have the time for it."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81cd-8fb6-ede837090cd3",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "did 6 problems today",
    "date": "2024-01-11",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "P1456, medium, 10:04, repetition of max subarr"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1004, medium, 1:22:23, took a lot of time because I had developed my own logic but turned out it was ignorant of many corner cases so wasted a lot of time and finally solved with the solution."
      },
      {
        "component": "bulleted_list_item",
        "text": "P1493, medium , 3:27, special case of P1004"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1732, easy , 5:43, prefix sum "
      },
      {
        "component": "bulleted_list_item",
        "text": "P2215, easy, 26:55, learned the syntax of sets and maps"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1207, easy , 5:15"
      },
      {
        "component": "paragraph",
        "text": "learned about winsock today, to make a client you do not need to do any logic part there is mostly copy pasting of code from the docs or web as there is nothing new to do just follow the instructions. I guess I will start getting the data from PMU by tommorrow."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8136-a40e-c25c477aa2c0",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Backtracking",
    "date": "2024-05-23",
    "description": [
      {
        "component": "paragraph",
        "text": "LC :"
      },
      {
        "component": "bulleted_list_item",
        "text": "216. Combination Sum III | Medium/Easy "
      },
      {
        "component": "bulleted_list_item",
        "text": "17. Letter Combinations of a Phone Number | Medium/Easy"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-810a-93dc-ce9d238e0037",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Took a break on project",
    "date": "2024-01-14",
    "description": [
      {
        "component": "paragraph",
        "text": "Didn’t go to the lab for project work for I was busy flying kites :)"
      },
      {
        "component": "paragraph",
        "text": "Leetcode"
      },
      {
        "component": "bulleted_list_item",
        "text": "P394; medium ; 2hr+ ;stacks; saw solution; this problem sucked me inside out. Happy that I did it finally."
      },
      {
        "component": "bulleted_list_item",
        "text": "P328; medium; don’t ask; linked list; saw solution, taking awful lot of time in these newer topics."
      },
      {
        "component": "bulleted_list_item",
        "text": "P649;medium;40:08;queue; saw solution, very new problem and solution logic."
      },
      {
        "component": "bulleted_list_item",
        "text": "P933;easy;5:02;queue"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8163-9171-c3d633214993",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Voillla",
    "date": "2024-01-18",
    "description": [
      {
        "component": "paragraph",
        "text": "Understood the iPDC software and also figured out what I was doing wrong in the command frame that could not make us receive the data frames and the real CFG2 frame. Tomorrow I will surely move leap years ahead in the software! and that is the voilla moment."
      },
      {
        "component": "paragraph",
        "text": "Leetcode : all known data structures solved(Trie I’ve read it, probs will be done by tom), now need to do Tree(BFS,DFS) , Graph(BFS,DFS) , priority queue/heap , DP. 30 more problems in the blind 75."
      },
      {
        "component": "bulleted_list_item",
        "text": "P435; medium;58:45;Intervals;took 1 hint."
      },
      {
        "component": "bulleted_list_item",
        "text": "P452;medium;5:04;Intervals;special case of 435"
      },
      {
        "component": "bulleted_list_item",
        "text": "P901;medium;26:04; Montonic stack though i used vector."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81d6-a140-e6b66c3d4b54",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "DSA",
    "date": "2024-06-17",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "Text Justification."
      },
      {
        "component": "bulleted_list_item",
        "text": "Split the binary string into substrings with equal number of 0s and 1s"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-817b-b825-ef8a72d74d5c",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "It is decided",
    "date": "2024-01-16",
    "description": [
      {
        "component": "paragraph",
        "text": "It is decided I am going to do CSES right after I am done with blind 75. The goal is to finish the list before this semester is over. After that I’ll be working on previously asked questions from Uber and Google. It was a off day for the project."
      },
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P2300; medium; 1:25:43; Binary search ; solved with solution"
      },
      {
        "component": "bulleted_list_item",
        "text": "P162; medium; 35:36; Binary search; solved with solution"
      },
      {
        "component": "bulleted_list_item",
        "text": "P875; medium; 59:41;Binary search; took hints"
      },
      {
        "component": "bulleted_list_item",
        "text": "P338; easy; 6:31; Bit manipulation"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-819e-bca5-c9bd13dd12a0",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "The product is taking shape.",
    "date": "2024-06-16",
    "description": [
      {
        "component": "paragraph",
        "text": "The product I am trying to build is now giving me the chills. It is getting interesting, it began as a basic recommedation system for books based on your past reads, but now I feel like I finally have a product wrapped around this. The idea is to have the main page house the recommendor then the second page the books you’ve read, a page with reviews about them in form of blog posts which can be shared just like you can share your spotify playlists using urls. Finally a third page where you can upload your own epubs and mobi to read, the app will track your progress, keep updating your reading status on your public profile, which houses (already mentioned) reviews. Share your reading status and past reads with your friends. Recommendor gives you options to add past reads, your current mood for your next read and any biases you would like for the choice for example similar to reads suggestions by some great personalities like bill gates or elon musk."
      },
      {
        "component": "paragraph",
        "text": "Read through some notes of <a href=https://vinija.ai/recsys/index.html>Vinija’s notes</a> also this <a href=https://developers.google.com/machine-learning/recommendation>google’s course </a>on recommendation systems. Finally settled on developing a system that recommends by using both content based and collaborative filtering, more of Cb. Will be going through and implementing this research paper : "
      },
      {
        "component": "paragraph",
        "text": "<a href=https://www.inderscienceonline.com/doi/abs/10.1504/IJBIDM.2020.104738 >paper</a>  published by "
      },
      {
        "component": "paragraph",
        "text": "Yiu-Kai Ng Computer Science Department, Brigham Young University. "
      },
      {
        "component": "paragraph",
        "text": "Cheers."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81d9-803b-e35e9963908c",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Trie",
    "date": "2024-01-17",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode"
      },
      {
        "component": "paragraph",
        "text": "Learned about Trie data structure but could not implement it today. Will see it tomorrow. Wrote a twitter bot that posts the solved questions on my twitter as well 😇 find the profile here : https://twitter.com/arpitvermahere"
      },
      {
        "component": "bulleted_list_item",
        "text": "P136; Easy ; bit manipulation; Did it using maps space O(n) but Got to know that XOR(^) of two same number returns 0 like a cancelling effect, thus A^B^A = B!"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1318; Medium; 36:11; Bit manipulation complete."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8162-b743-f37c1d9d8b1b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "need to think something about this recording thing.",
    "date": "2024-05-30",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "Merge Intervals | Leetcode | Medium | Array"
      },
      {
        "component": "bulleted_list_item",
        "text": "Next Permutation | Leetcode | Medium | Array"
      },
      {
        "component": "bulleted_list_item",
        "text": "https://leetcode.com/problems/best-time-to-buy-and-sell-stock/"
      },
      {
        "component": "bulleted_list_item",
        "text": "Count Inversions | GFG"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81fe-877a-ce4ad01c503b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Little progress",
    "date": "2024-06-07",
    "description": [
      {
        "component": "paragraph",
        "text": "I read through most of the important concepts of rust. And boi rustaceans are just so much spent on solving the memmory safety issue that c/c++ had. The pointers are smart pointers with owners, In threads prefer communication over channels and if required to use shared memory use “move” to pass the ownership to the thread! If required access by multiple threads use a smart pointer that has one to many owner relation(Arc,Rc). The language is’nt completely object oriented you don’t have classes instead you use structs and impl as classes make structs obsolete and vice versa :). "
      },
      {
        "component": "paragraph",
        "text": "The libraries are bare bones; I saw for the first time a http server library exposing that it is creating a Socket and then adding a TCP listener to it like for real! Who does that, everyone is just hiding it into one single function lols. "
      },
      {
        "component": "paragraph",
        "text": "Well I did’nt like writing software in C++ in the beginning but as time passed man I loved it. Wish it works out the same with rust 🦀."
      },
      {
        "component": "bulleted_list_item",
        "text": "Kth smallest element in a row-column wise sorted matrix | GFG | Very similar logic to median in two sorted arrays. That question is very important."
      },
      {
        "component": "bulleted_list_item",
        "text": "Maximum size rectangle | GFG | Good question, same problem in stacks as largest area of a histogram."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81a7-8ff9-f8dff4042f9e",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "More Arrays",
    "date": "2024-05-31",
    "description": [
      {
        "component": "paragraph",
        "text": "Can not find time to do something about this notion page tracker?! will do something tommorrow. "
      },
      {
        "component": "bulleted_list_item",
        "text": "find all pairs on integer array whose sum is equal to given number | GFG | Arrays | Very common."
      },
      {
        "component": "bulleted_list_item",
        "text": "Rearrange the array in alternating positive and negative items with O(1) extra space | Article "
      },
      {
        "component": "bulleted_list_item",
        "text": "find common elements In 3 sorted arrays | GFG | Easy"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-816f-ac05-da68a61001bc",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "starting to observe a pattern in these questions.",
    "date": "2024-06-03",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "find maximum product subarray | GFG | could’nt understand the solution too much will look again."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81e9-b67a-c1e7cef92489",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Wrote multi threaded program in c++",
    "date": "2024-02-12",
    "description": [
      {
        "component": "paragraph",
        "text": "Yupp, made multiple threads out of the main thread in the PDC software. Well the solution emerged out the very fundamental requirement of the PDC to connect with multiple PMUs at the same time. Since the program runs an infinite loop to accept data from the PMU continuously, you cannot process anything else. The major issue was that we could not run the sendCloseCommand function and stop the communication by our choice only option was to CTRL C. Thus implemented a 3 thread program that accepts data from three pmu and receives user commands on the main thread."
      },
      {
        "component": "paragraph",
        "text": "I was super excited while writing code for this part I didn't want to leave the lab even though I had a class at 2PM 😁"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81f7-a985-f3a07aef3e55",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started Final450",
    "date": "2024-05-28",
    "description": [
      {
        "component": "paragraph",
        "text": "Started Final450, starting ones are easy as expected."
      },
      {
        "component": "bulleted_list_item",
        "text": "Reverse the array"
      },
      {
        "component": "bulleted_list_item",
        "text": "Find the maximum and minimum element in an array"
      },
      {
        "component": "bulleted_list_item",
        "text": "Find the \"Kth\" max and min element of an array"
      },
      {
        "component": "bulleted_list_item",
        "text": "Given an array which consists of only 0, 1 and 2. Sort the array without using any sorting algo"
      },
      {
        "component": "bulleted_list_item",
        "text": "Move all the negative elements to one side of the array"
      },
      {
        "component": "bulleted_list_item",
        "text": "Find the Union and Intersection of the two sorted arrays."
      },
      {
        "component": "bulleted_list_item",
        "text": "Write a program to cyclically rotate an array by one."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8143-a674-eb6b8b360678",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Wrote some react tests for TODO app",
    "date": "2024-02-02",
    "description": [
      {
        "component": "paragraph",
        "text": "Got to learn how to write unit tests for react projects and realized how important it is to write them in bigger applications. I am working on a PDC software myself and as the days are passing by the application is becoming very large it is already more than 1000 lines of code."
      },
      {
        "component": "paragraph",
        "text": "To make it easier to debug when something breaks and to protect the company from pushing bugs into the live project it is very important to write tests."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81d7-a7bd-c194997fff81",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "woah! been a while",
    "date": "2024-05-14",
    "description": [
      {
        "component": "paragraph",
        "text": "Close to two months now. Well this post goes to explain where have I been and what am I planning to do with this blog space."
      },
      {
        "component": "paragraph",
        "text": "I was applying for Internships for the past two months, finally got one at BlueStacks. Applying requires you to constantly be prepping for interviews and taking OA and making assignments, explains why I stopped solving DSA problems. "
      },
      {
        "component": "paragraph",
        "text": "The windows application I was building as a course project under IIT Ropar was a blast or should I say could’nt have been better. On the last day of the project, just a night before the final demonstration while testing the application on a different pc I observed that the application kept crashing after some 10-15 minutes while it won’t crash on the pc I used to work on. My head was spinning I had been testing the application for a while now but it worked for hours and hours on end. That night I was sold on the idea I’d be working on fixing the bug for the whole night. I tried everything “maybe the PMUs not working right ? change it”, “Maybe we have missed locking some common resource somewhere and the application is not thread safe and literally out of desperation I sprinkled mutex anywhere and everywhere I could think of” , “Maybe there is some error in the buffer to hex function and spent an hour trying several different iterations and AI models to fix up the issue all these possibilities because all that Visual studio could give as error was {an exception occured: Accessing memmory without permission} or something along similar lines.” and finally when I was about to give up I went out for a walk, One possiblity came to my mind - what the fucking if there are losses in the lan cable on the pc I was testing the application on!!. and bang that hit the bullseye. When I came back to the lab one of my good friend, team member came in as well and boi that we solved the bug in minutes. We basically had missed adding error handling for cases when the received data buffer was null and the software was trying to parse empty buffer/data arrays. I then ran the application the whole night on my PC over wifi! and it worked like a charm."
      },
      {
        "component": "paragraph",
        "text": "I learnt a lot from this project and made a good friend."
      },
      {
        "component": "paragraph",
        "text": "About this blogs page, well I have a 6 month internship so I am free from college for the next semester. I have some spare time after my internship work to allocate to problem solving and developing personal projects and this page serves the exact purpose “to document my daily learnings : ) “ So daily updates are on their wayyy! "
      },
      {
        "component": "paragraph",
        "text": "Cheers,"
      },
      {
        "component": "paragraph",
        "text": "Arpit"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8122-83d7-d05077b93008",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started String",
    "date": "2024-06-09",
    "description": [
      {
        "component": "paragraph",
        "text": "I am kinda bored of writing code for the framework I have created. Like whatever I have done is somewhat ground up but it does not have any innovation or any big reason for people to adopt it and that sucks. Everytime I sit down to do something about it, I just get fed up of lack of something new and don’t get anything done. Need to figure something new for this the next weekend."
      },
      {
        "component": "paragraph",
        "text": "Also I realized that reading articles as listed in the sheet isn’t helping at all, so I’ll replace it with similar practice questions."
      },
      {
        "component": "bulleted_list_item",
        "text": "Reverse a String | LC | Easy"
      },
      {
        "component": "bulleted_list_item",
        "text": "Check whether a String is Palindrome or not | GFG | Easy"
      },
      {
        "component": "bulleted_list_item",
        "text": "316. Remove Duplicate Letters | LC | Good question, could’nt solve needed solution, this guy helped <a href = https://www.youtube.com/watch?v=rU5p0MRm5zU>link</a>"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81bd-94a7-f2db39442acf",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "So I have a Idea",
    "date": "2024-06-12",
    "description": [
      {
        "component": "paragraph",
        "text": "Instead of spending my weekends improving the frontend framework I authored I am thinking of creating a website that can fetch a lot of traffic. The idea is to develope a web app that can provide you recommendations for books to read based on your past reads. Also in house a epub reader with syncing across all devices, also works as your read management place i.e. write your reviews about the book and what you’ve read in one place easy to share with people. The attracting factor is the recommendation system. I guess it will get some amount of traffic lets see."
      },
      {
        "component": "bulleted_list_item",
        "text": "Count and Say problem | LC | Easy, I don’t know what I was thinking yesterday."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-819a-a649-e302200a8bec",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "classic graph bfs prob now.",
    "date": "2024-02-22",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "P994;required solution;medium;bfs;graphs"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8190-b0f2-cabc470779df",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "236. Lowest Common Ancestor of a Binary Tree",
    "date": "2024-01-30",
    "description": [
      {
        "component": "paragraph",
        "text": "kept trying to solve it for idk how long. I was struggling with making the traverse deque but finally did it. Worth it."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8127-b2ef-c2d9d939e1f1",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Finally finished LC 75",
    "date": "2024-05-24",
    "description": [
      {
        "component": "paragraph",
        "text": "Finally the <b>LeetCode 75</b> is over. Took me 140 days(4 months 19 days!). Would be solving a sheet by love babbar now, that famous final450 and finally plan on doing the CSES. let’s see how much gets done by the end of this year."
      },
      {
        "component": "paragraph",
        "text": "yesterday I watched this Ted talk <a href=https://youtu.be/5MgBikgcWnY?si=tCr9Cr3-4rDJbXPR>youtube</a> and I must say, It was wonderful. He mentioned about the 10000 hour rule from the book “Peak” I had read last year. He finally quotes that it is about 20Hours of deliberate practice that is required to become significantly good at something. Hence took up my dusting ukulele and started on the journey to devote atleast 20h to the instrument :)"
      },
      {
        "component": "paragraph",
        "text": "Solved : Both of them good problems, Had seen them a week ago but could not solve. Watched solutions for both :<"
      },
      {
        "component": "bulleted_list_item",
        "text": "2542. Maximum Subsequence Score | Priority queue | Medium"
      },
      {
        "component": "bulleted_list_item",
        "text": "2462. Total Cost to Hire K Workers | Priority queue | Medium "
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8100-97bb-f2f33111989b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Starting Learning in Public",
    "date": "2024-01-05",
    "description": [
      {
        "component": "paragraph",
        "text": "Fixed many bugs that were present in this blogs page and hooked it up with notion API, HENCE we’ll be having daily updates on what I am learning."
      },
      {
        "component": "paragraph",
        "text": "Had in mind to restart that leetcode grind today, but all my time went into fixing this page. Learned some stuff about how Notion API works, every page is divided into its metadata and content. Content is the parent of several blocks of different types of component i.e. paragraphs, codes, numbered item lists, bulleted item lists and so on. "
      },
      {
        "component": "paragraph",
        "text": "Retrieving the data was the easy part just create a integration on the dev page and put in the your client secret in the getting started code. The real headache was formatting the data of this page. Fortunately I found this <a href = https://youtu.be/97ARQTHyf1c?si=zJNKNztjMbsK6bMG>guy</a> , my man helped a lot, Thanks Sean. I guess that’s all I learned today.  "
      },
      {
        "component": "paragraph",
        "text": "Cheers to the new beginning."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81b7-9ac6-c2c349bb97ed",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": " Tried compiling vlc",
    "date": "2024-02-23",
    "description": [
      {
        "component": "paragraph",
        "text": "Tried compiling vlc on my ubuntu system, getting more and more interested in cpp dev."
      },
      {
        "component": "paragraph",
        "text": "Leetcode"
      },
      {
        "component": "bulleted_list_item",
        "text": " P215 using sorting🙂 need to learn heaps"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8187-ac09-ca3834c16b5a",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Updated the CMS",
    "date": "2024-06-01",
    "description": [
      {
        "component": "paragraph",
        "text": "Moved everything from google sheets into one single section of notion. Also increased the startup script runtime speed by using promise.all when sending request to notion api, this way requests for all the blog posts detail are send at the same time thus they get completed really fast parallelly."
      },
      {
        "component": "paragraph",
        "text": "Did some tweaks to the analytics section of this page. Its better now, easier to track progress."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8140-8f94-e24390b532fe",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started Matrix",
    "date": "2024-06-06",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "Spiral traversal on a Matrix | GFG | medium to easy"
      },
      {
        "component": "bulleted_list_item",
        "text": "Search an element in a matrix | GFG | Many times the edge cases and bugs in my code are solved by chat gpt this is not good, i should do it myself! "
      },
      {
        "component": "bulleted_list_item",
        "text": "Find median in a row wise sorted matrix | GFG | Very similar to yesterdays problem of finding median in two sorted arrays. just now increase that 2 to n."
      },
      {
        "component": "bulleted_list_item",
        "text": "Find row with maximum no. of 1's | GFG | The expected approach was written as o(m+n) but it accepted a o(m*n) solution as well, strange. though i learned the optimised solution 🤝"
      },
      {
        "component": "bulleted_list_item",
        "text": "Print elements in sorted order using row-column wise sorted matrix | GFG | easy question due to very leniant time complexity."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8129-882f-e8e715fbf90a",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Most mind boggling problem solved till date",
    "date": "2024-02-19",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode : "
      },
      {
        "component": "bulleted_list_item",
        "text": "P399 Evaluate divisions ; graphs ; dfs ; medium ; I had written the code for this problem yesterday only but it had some bugs and only I know the struggle I had to go through to find these mindfucks."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81a5-873b-f02134686403",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Python also does shallow copies",
    "date": "2024-06-10",
    "description": [
      {
        "component": "paragraph",
        "text": "I did’nt know python also does shallow copies when used with equality signs, I used to believe python always does deep copies as never heard of pointers and references in python💁‍♂️. Got to know about this when I spent the whole day just to figure out why my code does’nt work even though it looks correct ;/"
      },
      {
        "component": "bulleted_list_item",
        "text": "Roman to Integer | LC | Easy"
      },
      {
        "component": "bulleted_list_item",
        "text": "Write a Code to check whether one string is a rotation of another | GFG | Tricky."
      },
      {
        "component": "bulleted_list_item",
        "text": "Integer to Roman | LC | Real good question."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81c1-b2df-f920405c6a68",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "installed an extension",
    "date": "2024-02-08",
    "description": [
      {
        "component": "paragraph",
        "text": "That won’t let me browse until i solve a leetcode problem."
      },
      {
        "component": "bulleted_list_item",
        "text": "P21 ; Linked list; Easy"
      },
      {
        "component": "bulleted_list_item",
        "text": "P841; Graphs dfs; medium"
      },
      {
        "component": "bulleted_list_item",
        "text": "P62; DP ; Medium, 1st dp problem tbh more of a combinatorics problem."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-812b-8b26-f8823c287da2",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Woahh!",
    "date": "2024-01-29",
    "description": [
      {
        "component": "paragraph",
        "text": "DEP :"
      },
      {
        "component": "paragraph",
        "text": "Have made a significant progress in the PDC software, can parse data and store in text files in real time. Need to write code to start writing that data to excel."
      },
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "paragraph",
        "text": "After successfully giving up on DSA because solving binary trees was difficult I am finally back. hushh it was a bad week. I was not trying hard enough, not forcing myself to think just running behind time and solutions. Took advice from a lot of people - “ it will come to you only by solving problems ‘no videos can’t help!’ “"
      },
      {
        "component": "bulleted_list_item",
        "text": "P437; medium; did with brute force"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1372; partially solved; medium; brute force"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8136-9aeb-e7c07ac143a9",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Arrays complete",
    "date": "2024-06-05",
    "description": [
      {
        "component": "paragraph",
        "text": "Wanted to learn about rust for a long while now, finally had the opportunity to learn it and let me tell you why people love it. Imagine if you could add a package manager to c++ removing the hassle of maintaining header files yourself (the most painstaking thing of c++) add a bit of ownership removing the hassle of managing the heap memmory and some more things(I still need to read those) and voilla you have a super fast guns blazing language to build and distribute your software with 🤝."
      },
      {
        "component": "bulleted_list_item",
        "text": "Chocolate Distribution problem | GFG | Easy"
      },
      {
        "component": "bulleted_list_item",
        "text": "Smallest Subarray with sum greater than a given value | GFG | good question had to think a bit"
      },
      {
        "component": "bulleted_list_item",
        "text": "Three way partitioning of an array around a given value | GFG | I was just about to give up on the problem but then i tried something random and it worked."
      },
      {
        "component": "bulleted_list_item",
        "text": "Minimum swaps required bring elements less equal K together | GFG"
      },
      {
        "component": "bulleted_list_item",
        "text": "Minimum no. of operations required to make an array palindrome | GFG"
      },
      {
        "component": "bulleted_list_item",
        "text": "Median of 2 sorted arrays of equal size | GFG"
      },
      {
        "component": "bulleted_list_item",
        "text": "Median of 2 sorted arrays of different size | GFG | Bin search and priority queue ones are important"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81e9-aee6-f4eb7b888da6",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Structs create senseless errors",
    "date": "2024-02-20",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1926 ; fairly easy bfs problem but structs wasted me."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8107-845f-eca4beeae261",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started a study plan on leetcode for blind 75",
    "date": "2024-01-10",
    "description": [
      {
        "component": "paragraph",
        "text": "solved 4 problems today :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P392, easy, 5:54"
      },
      {
        "component": "bulleted_list_item",
        "text": "P11 container with most water, medium, 22:28"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1679 max number of k sums, medium, 20:21"
      },
      {
        "component": "bulleted_list_item",
        "text": "P643 maximum avg subarray, easy, 1:06:24 , took a while to get the concept of sliding window in my head."
      },
      {
        "component": "paragraph",
        "text": "Tried doing some work on my DEP project but nothing significant came out of todays work."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-817f-8829-d9d8fddde0b7",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started Leetcode 75",
    "date": "2024-01-06",
    "description": [
      {
        "component": "paragraph",
        "text": "solving problems on strings"
      },
      {
        "component": "bulleted_list_item",
        "text": "p1768, easy, 12:05"
      },
      {
        "component": "bulleted_list_item",
        "text": "p1071, easy, 24:12"
      },
      {
        "component": "bulleted_list_item",
        "text": "p1431, easy, 5:01"
      },
      {
        "component": "bulleted_list_item",
        "text": "p605,easy moderate, 32:48 ; good question, 3 pointer "
      },
      {
        "component": "bulleted_list_item",
        "text": "p345, easy, 7:08"
      },
      {
        "component": "bulleted_list_item",
        "text": "p151, medium , 21 + 8 minute spent will do this again couldn’t solve it."
      },
      {
        "component": "paragraph",
        "text": "Gave the div 4 contest on codeforces solved only 2 problems. Was bad but anyways you need to start somewhere."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-817a-83f9-f962a0f1d29b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Consistency!",
    "date": "2024-01-31",
    "description": [
      {
        "component": "paragraph",
        "text": "Felt like skipping today."
      },
      {
        "component": "bulleted_list_item",
        "text": "P1372; Solved in O(n); required solution"
      },
      {
        "component": "bulleted_list_item",
        "text": "P199; BFS; medium; "
      },
      {
        "component": "bulleted_list_item",
        "text": "P1161:BFS;medium;"
      },
      {
        "component": "paragraph",
        "text": "footnote → Mehdi Hassan is best"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-817e-bb88-f2f86f07682b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Course work starts consuming time",
    "date": "2024-01-15",
    "description": [
      {
        "component": "paragraph",
        "text": "Not much happened in the project, Realised that the config file received is wrong or maybe the way I converted the buffer to binary was wrong."
      },
      {
        "component": "paragraph",
        "text": "Leetcode, I have decided since some data structures like trees, graphs and heaps are new to me I’ll be doing them in the last after completing other familiar topics in the sheet as these newer ones will require me to study them for a while,  DP included. Could only manage to do 1 question."
      },
      {
        "component": "bulleted_list_item",
        "text": "P739, Medium, Monotonic stack."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81f5-aa69-c16042db76e5",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Did first tree question on my own",
    "date": "2024-01-22",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode : "
      },
      {
        "component": "bulleted_list_item",
        "text": "P872; easy; 26:10"
      },
      {
        "component": "paragraph",
        "text": "Leetcode : 23-01-24"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1448; medium; with solution"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-810d-9b1f-efa3b195de09",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Rust",
    "date": "2024-06-15",
    "description": [
      {
        "component": "paragraph",
        "text": "I have started learning about recommendation systems and think if possible I’ll write my algorithm for book ranking in rust cause why not."
      },
      {
        "component": "paragraph",
        "text": "built a port sniffer on ip addresses using rust, followed this tutorial <a href=https://www.youtube.com/watch?v=-Jp7sabBCp4&list=PLJbE2Yu2zumDD5vy2BuSHvFZU0a6RDmgb&index=1>link</a>. Feels good that I am getting a hang of the language."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8197-adce-f7ec46d573f2",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Solved 4 problems today",
    "date": "2024-01-09",
    "description": [
      {
        "component": "paragraph",
        "text": "Wanted do more as punishment but currently I am too slow."
      },
      {
        "component": "bulleted_list_item",
        "text": "P283, easy, couldn’t solve had to watch the soln."
      },
      {
        "component": "bulleted_list_item",
        "text": "P238, medium, again couldn’t solve, had to see the solution while i did the code myself i was still stuck as i was not counting for the time complexity of the inbuilt function of insert in cpp."
      },
      {
        "component": "bulleted_list_item",
        "text": "P334,medium,solution"
      },
      {
        "component": "bulleted_list_item",
        "text": "P443,string compression, Medium. Wasted a lot of time as i could not figure out how what was happening at the boundary of chars vector."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-813b-85ca-e93f2d741f31",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Matrix complete",
    "date": "2024-06-08",
    "description": [
      {
        "component": "paragraph",
        "text": "Started working on the pre-react js framework in hopes on making it good enough to be used by people. I am thinking to focus the framework in the PWA space. Named it near-native now. Hoping to complete the framework and then write a epub and mobi reader PWA nearly similar to or better than lithium which aims at maintaing reading history across devices. Lets see, I’ll publish a medium article and some other blogs as well to make near-native popular , finally making the framework I built be seen by people 😭."
      },
      {
        "component": "bulleted_list_item",
        "text": "Common elements in all rows of a given matrix | GFG Article"
      },
      {
        "component": "bulleted_list_item",
        "text": "Rotate matrix by 90 degrees | GFG Article"
      },
      {
        "component": "bulleted_list_item",
        "text": "Find a specific pair in matrix | GFG Article | Good question"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8157-a78a-dbad382b6791",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Jest",
    "date": "2024-02-01",
    "description": [
      {
        "component": "paragraph",
        "text": "Learnt about component testing in javascript in react. "
      },
      {
        "component": "paragraph",
        "text": "Started writing unit tests for a basic todo react app cloned from github. "
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-813d-906e-eb8808a4c49e",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Studied Binary Trees",
    "date": "2024-01-20",
    "description": [
      {
        "component": "paragraph",
        "text": "PDC :"
      },
      {
        "component": "paragraph",
        "text": "Verified that the data stream we are receiving is correct and also started decoding the data frame objects."
      },
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "paragraph",
        "text": "Read about the Binary trees and how to create them. Did BST , DFS(pre,post,in) traversals.Will start the trees questions from tomorrow."
      },
      {
        "component": "bulleted_list_item",
        "text": "P104; easy; with solution."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81f6-909c-fece97cdec8c",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "bad start to the week ",
    "date": "2024-06-11",
    "description": [
      {
        "component": "paragraph",
        "text": "Going really bad need to get to speed."
      },
      {
        "component": "bulleted_list_item",
        "text": "Print all Subsequences of a string. | GFG Article | have done a similar problem before, so article works. Also the fastest time complexity for this is O(2^n)."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81d0-938a-efd7db94647b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "…",
    "date": "2024-06-22",
    "description": [
      {
        "component": "paragraph",
        "text": "Tried giving the leetcode contest 133. Did two questions Was stuck with TLE for the third one."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-816f-a97e-dbb4f87151d4",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Crazyy🤯",
    "date": "2024-06-04",
    "description": [
      {
        "component": "paragraph",
        "text": "Only the first problem had the crazy factor."
      },
      {
        "component": "bulleted_list_item",
        "text": "Find longest consecutive subsequence | GFG | Found a recursive solution and thought it won’t work. Got accepted in the first run🤯🤯. Took 26 minute to just figure out the solution and to write code it was 20 minutes more. Good question highly recommend."
      },
      {
        "component": "bulleted_list_item",
        "text": "Given an array of size n and a number k, fin all elements that appear more than \" n/k \" times. | GFG Article | got to know about boyer moore majority voting algo."
      },
      {
        "component": "bulleted_list_item",
        "text": "Maximum profit by buying and selling a share atmost twice "
      },
      {
        "component": "bulleted_list_item",
        "text": "Find whether an array is a subset of another array | GFG | stupid easy que."
      },
      {
        "component": "bulleted_list_item",
        "text": "Find the triplet that sum to a given value | GFG | Missed the sorting part and wasted some time."
      },
      {
        "component": "bulleted_list_item",
        "text": "Trapping Rain water problem | GFG/Leetcode | Need to do it again. Will check again tomorrow."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81ee-a668-fd7fe1a58834",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "??",
    "date": "2024-02-17",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P547 ; medium; graphs ; did using dfs and union find. For union find watched solution."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-816e-8e1d-c44fffc6d8a7",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started Socket Programming in C++",
    "date": "2024-01-07",
    "description": [
      {
        "component": "paragraph",
        "text": "Sockets are like pointers but for traversing networks. When you start a socket you are returned an integer that you can use to start communication between a server and client. "
      },
      {
        "component": "paragraph",
        "text": "There are two types of sockets"
      },
      {
        "component": "numbered_list_item",
        "text": "Socket stream - meant for reliable connections and data integrity. Protocols used are TCP/IP (Transmission control protocol)"
      },
      {
        "component": "numbered_list_item",
        "text": "Datagram socket - meant for speedy and unreliable connections, used in cases where some data loss is acceptable. Protocol used is UDP(user datagram protocol)."
      },
      {
        "component": "paragraph",
        "text": "Tried writing some code as well to start a basic server but could not figure out how to include winsock_32 something dll in vs code ig vs studio is required."
      },
      {
        "component": "paragraph",
        "text": "did not do much of the grind today, solved the problem151 I had left yesterday. It was about reversing the words in a string. Used two pointer method, had to watch the solutions though."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81ac-9189-c71f9f97d73a",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "forgot most of the topics",
    "date": "2024-05-15",
    "description": [
      {
        "component": "paragraph",
        "text": "Can’t remember anything about how you’d create heaps and use them to solve problems. It’s going to be hard getting to speed again. Sat down for some time on a problem could’nt solve will try tommorrow."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8137-9302-f18490d0c1c0",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Array questions can be tough",
    "date": "2024-05-29",
    "description": [
      {
        "component": "paragraph",
        "text": "Need to solve 4 questions daily for 5 days a week to finish the sheet by october this year."
      },
      {
        "component": "bulleted_list_item",
        "text": "Minimise the maximum difference between heights "
      },
      {
        "component": "bulleted_list_item",
        "text": "Minimum no. of Jumps to reach end of an array"
      },
      {
        "component": "bulleted_list_item",
        "text": "find duplicate in an array of N+1 Integers"
      },
      {
        "component": "bulleted_list_item",
        "text": "Merge 2 sorted arrays without using Extra space."
      },
      {
        "component": "bulleted_list_item",
        "text": "Kadane's Algo \n"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81ce-a19e-d8fb15611e5e",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Little progress with PDC software.",
    "date": "2024-01-12",
    "description": [
      {
        "component": "paragraph",
        "text": "Did today’s share of leetcode."
      },
      {
        "component": "bulleted_list_item",
        "text": "P724,easy, 17:37"
      },
      {
        "component": "bulleted_list_item",
        "text": "P2352,medium,22:43, thought my naive approach will tle but it didn’t, though it is kinda slow. Have to see a more optimized solution. Turns out you can compare two vectors easily using maps."
      },
      {
        "component": "bulleted_list_item",
        "text": "P2390; medium; 12:42, Following are some notes : It gave TLE in the first try."
      },
      {
        "component": "numbered_list_item",
        "text": "The reason why using ans.push_back(st.top()) and reversing the string before returning it works fine, while using ans = st.top() + ans results in TLE, is because the + operator for strings is an expensive operation."
      },
      {
        "component": "numbered_list_item",
        "text": "When you use ans = st.top() + ans, for every iteration of the while loop, you are creating a new string by concatenating the current character with the existing string. This new string is then assigned to the ans variable. As the size of the string increases, this operation becomes increasingly expensive, resulting in a TLE for larger inputs."
      },
      {
        "component": "bulleted_list_item",
        "text": "P735; medium; 49:48; solved with soln; was an easy question my logic was also correct but i could not implement it on time I was exhausted."
      },
      {
        "component": "paragraph",
        "text": "Progress in DEP project is really slow, I connected my pc to the PMU server though could not get any buffer or configuration file after connection, the code stopped at recv function everytime. This makes me wonder what if the machine is not sending any data packets in the first place."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8182-b98c-e67a1742a6dd",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "After a detour back at the grind",
    "date": "2024-02-04",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P700; BST; easy;"
      },
      {
        "component": "bulleted_list_item",
        "text": "P470;BST;medium;needed soln"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-814a-ac1a-fcd68d316487",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "changing to core dsa",
    "date": "2024-06-20",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "Write a Program to reverse the Linked List. (Both Iterative and recursive)"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8158-82c6-c4bc286b50e9",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Finally there’s motion in the project",
    "date": "2024-01-13",
    "description": [
      {
        "component": "paragraph",
        "text": "After commiting plenty of rookie mistakes we finally managed to establish a tcp connection with the phase measurement unit and received its config files. "
      },
      {
        "component": "paragraph",
        "text": "In the beginning we were thinking that the PMU is a client and it is sending out requests to connect to server to send data, I know it sounds stupid now but we were not given any port that should have suggested us the alternate. Till yesterday we were thinking okay now that it is a server, after connecting to it why the hell is it not sending any data. Finally today while going through the documentation of IEEE C37.118 protocol I came to understand the basic flaw in our approach."
      },
      {
        "component": "paragraph",
        "text": "For any communication to start be whatever the protocol there should be a command frame sent by the client to initiate the conversation. I’ve read it in the course on IOT but boy am I not stupid enough to ignore it while implementing and waste time😭. Finally sent a demo command frame according to the docs and voilla we had the gibberish of a config response. Have to decode that piece tomorrow and then we’ll start receiving the phase data."
      },
      {
        "component": "paragraph",
        "text": "Leetcode"
      },
      {
        "component": "bulleted_list_item",
        "text": "P394, Medium , Stacks, 1:30:12, unsolved as of now because I read the question wrong. Will do it tomorrow again."
      },
      {
        "component": "bulleted_list_item",
        "text": "P206, Easy, 20:40, Reverse linked list."
      },
      {
        "component": "bulleted_list_item",
        "text": "P2095, Medium, 23:12, Delete middle in linked list"
      },
      {
        "component": "bulleted_list_item",
        "text": "P2130, Medium , did using vectors to save time and streak, will do it the right way tomorrow."
      },
      {
        "component": "bulleted_list_item",
        "text": "P372, Easy , did easy binary search question to save time as it is 4:44 AM and I am trying to finish 4 questions for today and save my streak as new day for Leetcode starts at 5:30 AM in India. Had I not misread P394 I would have finished my problems by the evening itself."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81e5-bc73-eb4229c81197",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Restart",
    "date": "2024-09-10",
    "description": [
      {
        "component": "paragraph",
        "text": "Started Strivers SDE Sheet."
      },
      {
        "component": "bulleted_list_item",
        "text": "Longest Increasing Subsequence | DP"
      },
      {
        "component": "bulleted_list_item",
        "text": "Longest Common Subsequence | DP"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-814e-a145-ec792cab8750",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Wow questions !!",
    "date": "2024-06-02",
    "description": [
      {
        "component": "bulleted_list_item",
        "text": "Find if there is any subarray with sum equal to 0 | GFG | I tried solving with my O(n) approach but it had some bugs that could not be solved. The solution to this was tricky! what happens is when you search in the set/map for previously seen sum, what you are doing is saying ohh some element has appeared in between that took some part of the sum to zero and we are back at the sum we found at an earlier index :))"
      },
      {
        "component": "bulleted_list_item",
        "text": "Find factorial of a large number | GFG | at first I thought this ones a really basic problem, but later I realised that there is no data structure to store numbers with digit count of about 2000 digits, thus need vectors or string. And you can find the factorials by simply doing the multiplication like we used to do back in primary school :)"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8164-9a9a-c499e844fb2e",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Pass by reference is faster",
    "date": "2024-02-18",
    "description": [
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1466 : medium; graphs; dfs; took a small hint; at first my solution gave TLE for n =1647 and won’t submit, then I passed the adjacency list by reference it worked and the submission was accepted! Thank <a href=”https://phind.com”>phind</a>"
      },
      {
        "component": "paragraph",
        "text": "solved most of the P399 but need to debug some part. Man this problem was one heck of a find, you need to write essay long code and then debug the piece like you’re working on a software."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-819c-b7c2-eb3079b95752",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Started getting data stream",
    "date": "2024-01-19",
    "description": [
      {
        "component": "paragraph",
        "text": "Finally finally we have a data stream. Yesterday I was working on the project alone in the lab when Bibhu sir came and explained me about the structure of the iPDC software, That made me dig into the code again and surprisingly this time around I could understand the stuff I was overlooking before. Borrowed the command frame generation function and bamn we have a continuous stream of data."
      },
      {
        "component": "paragraph",
        "text": "Leetcode, summed up all the problems that i could solve with my current state of knowledge of dsa now starts the core DSA."
      },
      {
        "component": "bulleted_list_item",
        "text": "P208; medium; Trie"
      },
      {
        "component": "bulleted_list_item",
        "text": "P1268; medium; didn't complete  as it required knowledge of tree traversal and priority queue."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81f7-acb0-fe6485f7195a",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "…",
    "date": "2024-05-19",
    "description": [
      {
        "component": "paragraph",
        "text": "It is easier to start something new than to continue with something you left in between. Started learning DP, while I was supposed to finish solving problems from priority queue I could not. I used to sit down in front of the problem for some time and then just pass it on to the next day. Also videos are easy to get started on new things."
      },
      {
        "component": "paragraph",
        "text": "Leetcode :"
      },
      {
        "component": "bulleted_list_item",
        "text": "1137. N-th Tribonacci Number| easy | DP"
      },
      {
        "component": "bulleted_list_item",
        "text": "746. Min Cost Climbing Stairs| easy | DP"
      },
      {
        "component": "bulleted_list_item",
        "text": "198. House Robber; Medium | DP | had some difficulty understanding what the problem actually wants you to do(insufficient test cases) took hints."
      },
      {
        "component": "bulleted_list_item",
        "text": "790. Domino and Tromino Tiling | Medium/Hard | good problem had to look several tutorials on how to solve finally this one did the job,  <a href=https://youtu.be/RhhCWPGsJ0I?si=dn5CLiMmKBpOyRnL>youtube</a>, thanks bud :)"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81fd-add0-cdacf2f92dfa",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "How does this website work",
    "date": "2023-06-06",
    "description": [
      {
        "component": "paragraph",
        "text": "In January, I began drafting this article, and now, in July 2023, I realize I've been delaying its completion for quite some time. However, it's important to clarify that my procrastination wasn't centered around the article itself. Instead, it was due to the limited time I had available to address minor bugs in the Preact.js framework."
      },
      {
        "component": "paragraph",
        "text": "Speaking about the website, it operates on the Javascript library that I have developed. It functions as a single-page application with frontend hash routing, altering the URL with different hashes corresponding to various pages. When I deploy the website on a free-tier Platform as a Service (PaaS), it restricts direct access to other routes, making only the default route accessible through URL search and as I don’t have root access to these servers I had to opt for hash routing."
      },
      {
        "component": "paragraph",
        "text": "Not having an easy access to reliable servers for free meant no database and dynamic content on the website, to solve this I had to come up with some innovative solution to have a database that was convenient to update and tagged along with an API. I used google sheets for the projects and books I’ve read page. The data I maintain on the sheet is then hardcoded into the website repository using a Node.js-based automation script i wrote called gitcron. The script commits the changes in sheet on my behalf everytime I start my laptop. "
      },
      {
        "component": "paragraph",
        "text": "Google sheets wasn’t a good choice for a CMS for blogposts and learning in public updates, So I chose Notion for this and hooked it up with the same script to update the website content."
      },
      {
        "component": "paragraph",
        "text": "Flow of the Website"
      },
      {
        "component": "numbered_list_item",
        "text": "You visit any domain pointing to this website; currently, it's https://arpitverma.vercel.app"
      },
      {
        "component": "numbered_list_item",
        "text": "The remote server responds with an index.html and some JavaScript files that get stored in your browser's session storage."
      },
      {
        "component": "numbered_list_item",
        "text": "Now according to the route you are on in the website corresponding content is fetched from the stored javascript files."
      },
      {
        "component": "numbered_list_item",
        "text": "These javascript files place the stored html into the virtual-dom element in the index.html "
      },
      {
        "component": "numbered_list_item",
        "text": "The logic and dynamic aspects of the page are implemented separately. As JavaScript stored in session storage cannot perform logic functions, it's used solely to call upon variables."
      },
      {
        "component": "numbered_list_item",
        "text": "For the logic part, when a page is called, a corresponding logic script is injected in the index.html."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81e7-8eb1-f7c4d6801b7f",
    "created_time": "2025-05-02T13:59:00.000Z",
    "title": "Chat GPT has gotten really good",
    "date": "2024-05-22",
    "description": [
      {
        "component": "paragraph",
        "text": "LC :"
      },
      {
        "component": "bulleted_list_item",
        "text": "714. Best Time to Buy and Sell Stock with Transaction Fee | 2D DP | Medium | wrote all the code by myself but took help of chatgpt to debug. It has got really good now, earlier it wouldn’t understand shit about the code and just return the solutions from the web but it can now modify your code correctly!"
      },
      {
        "component": "bulleted_list_item",
        "text": "72. Edit Distance | Hard | did’nt give a lot of time just looked through and understood the top down solution. | will do again sometime."
      }
    ]
  }
]