[{"book_name":"Never split the difference ","read_date":"Jan 2024","cover_url":"https://imgs.search.brave.com/rmA82LHj7brC-0DOYr-AQuFysKVpAVdK0j-yXj1rVv8/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9pbWFn/ZXMtbmEuc3NsLWlt/YWdlcy1hbWF6b24u/Y29tL2ltYWdlcy9J/Lzgxb1VQRUlmNk9M/LmpwZw","description":"started reading , well structured book. "},{"book_name":"Parable of the pipeline ","read_date":"Jan 2024","cover_url":"https://imgs.search.brave.com/kpVEB-UG7ZSqb_mpC2jvdqcYXYCMnrLkWo7_YUFhpzs/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9tLm1l/ZGlhLWFtYXpvbi5j/b20vaW1hZ2VzL0kv/NTFGLXljN2FWRkwu/anBn","description":"One go read. Widens your perspective towards passive income aka the pipelines. Was written back in the day when MLM was a thing thus makes the times leverage part kind of irrelevant today but surely puts up a thought in your head about core idea that the time vs work can't be a straight line forever. Ah yes ditched 'The great gatsby' couldn't get past the first chapter tbh."},{"book_name":"Norwegian Wood","read_date":"Dec 2023 - Jan 2024","cover_url":"https://rukminim2.flixcart.com/image/416/416/ki96c280-0/book/n/h/e/norwegian-wood-original-imafy36nzw3hhrgb.jpeg?q=70","description":"If I keep it short \"Love life of a college going unsocial main character who does not know what is he doing with his life.\" \nLonger version of my review will say that the book is worth a read even if the story isn't moving and the best out there. The way characters are weaved, it is the best I've seen so far. Murakami describes every scene in words so vividly that you start to have a strong visual of the place in your head as if you were there watching everything\nhappen in front of your own eyes. The evening when Watanabe and Midori sat there on the terrace watching a fire in her neighbourhood or when Watanabe visits Naoko in her sanatorium I feel as if these are my own memories. Also I heard the norwegian wood song by beatles on loop for days:)\nAll in all a good book if you want to feel as if you are living in a story."},{"book_name":"Peak","read_date":"Aug 2023 - Sept 2023","cover_url":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWzwPXpgJ8Acq9aH___DNYqo7nQJsaKrLT4g","description":"Left it in between as it became repetitive of the same content covered in the beginning. Three of the important learnings I got from the book include first learning happens just beyond the comfort zone you need to push yourself just enough that you are in the state of practice where things are hard but doable for sure. Second learning would be that no expert does not go by the face value of things what that means is that every expert devises a way of his own slightly tweaked to the defined way to do the thing say for example a chess grand master does not see two three pieces and moves at a time he views the whole board and all the pieces at once and compares them to the situations he had practiced on before called a mental representaion, hope that makes some sense. Third learning would be that there is something called deliberate practice to acheive greatness in a particular field, Deliberate practice basically means that you should follow the instructions laid out by the experts of the field and devise your own methods over it while maintaing your practice just beyond the comfort zone it is not the number of hours you put in but it is the amount of effective practice that you put in thus experts are not made in 10000 hours but below or above that number depending on the practice efficiency."},{"book_name":"It happens for a reason","read_date":"Aug 2023","cover_url":"https://m.media-amazon.com/images/I/51gk96JiXzL._AC_UF1000,1000_QL80_.jpg","description":"Good story, Bought it just by the name of Preeti Shenoy and boy was it worth it. Was looking for a story that could grip me to finally finish it(I started a lot of fictions but never finished them:{) and this was the one after a long time"},{"book_name":"Psycho-Cybernetics","read_date":"July 2023","cover_url":"https://m.media-amazon.com/images/I/41uiX93jl8L._SX309_BO1,204,203,200_.jpg","description":"Discontinued Reading it mid way. Will finish one day."},{"book_name":"Let's Talk Money","read_date":"July 2023","cover_url":"https://m.media-amazon.com/images/I/51YJ9xQuWfS._SX324_BO1,204,203,200_.jpg","description":"Was suggested by some youtube video and boy was this book a good one. It is so much informative I'd have to come back to this again and again. Must read if you want to learn about personal finance."},{"book_name":"Doglapan","read_date":"June 2023","cover_url":"https://rukminim2.flixcart.com/image/416/416/xif0q/book/l/o/t/doglapan-original-imagmxk5qzfebqwj.jpeg?q=70","description":"Stumbled on this as an accident but it was a nice journey. Had me learn a lot about behind the scenes of indian startups."}]