[
  {
    "id": "258e9933-5fca-8005-8c2e-c08a78fcd95c",
    "created_time": "2025-08-23T10:23:00.000Z",
    "book_name": "The Six Pillars of Self Esteem",
    "read_date": "2025-08-22 to Reading ...",
    "cover_url": "https://m.media-amazon.com/images/I/91+wmi0G1VL.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "More of a need tbh"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81b4-a8de-e22bfa77cb4c",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "The Almanack of Naval Ravikant",
    "read_date": "2025-01-04 to 2025-05-05",
    "cover_url": "https://m.media-amazon.com/images/I/51lUeX6L2BL._AC_UF1000,1000_QL80_.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "Heard a lot of reviews saying how magical of a read it is let’s see."
      },
      {
        "component": "paragraph",
        "text": "Very compressed, some ideas are good but just anecdotes and advice. "
      },
      {
        "component": "paragraph",
        "text": "Left one fourth of the book unread, had lost the excitement to read further."
      },
      {
        "component": "paragraph",
        "text": "Two thoughts really stood out."
      },
      {
        "component": "bulleted_list_item",
        "text": "Blind Luck – Pure chance, outside of your control. Things just happen to go your way (fate, fortune, randomness)."
      },
      {
        "component": "bulleted_list_item",
        "text": "Luck from friction – Created by persistence, hard work, and hustle. By being active and stirring things up, you increase the odds of lucky breaks finding you."
      },
      {
        "component": "bulleted_list_item",
        "text": "Luck from Preparation – Comes from skill and awareness. When you’re highly knowledgeable in a field, you notice opportunities and lucky breaks others miss."
      },
      {
        "component": "bulleted_list_item",
        "text": "Luck from Character – The rarest and most powerful. You build a unique reputation, expertise, or brand so opportunities seek you out. At this level, what others call “luck” is really the result of who you’ve become."
      },
      {
        "component": "paragraph",
        "text": "“You start as a salaried employee. But you want to work your way up to try and get higher leverage, more accountability, and specific knowledge. The combination of those over a long period of time with the magic of compound interest will make you wealthy.”"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-813b-b2c1-f9f61fc317ea",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Kafka on the Shore",
    "read_date": "2024-08-14 to 2024-12-29",
    "cover_url": "https://m.media-amazon.com/images/I/81tdbrewW0L._AC_UF1000,1000_QL80_.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "Was kind of switching between this and system design book now and then. "
      },
      {
        "component": "paragraph",
        "text": "The storyline is very very veryy dreamy. Different from norwegian wood and kind of similar to it at the same point. "
      },
      {
        "component": "paragraph",
        "text": "The curse could have been something else as it did’nt make any sense throughout the book. Also the story was out of place most of the things were never explained. Do not recommend."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8196-9248-e8d9c6cebf3b",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "System Design Interview – An insider's guide",
    "read_date": "2024-06-20 to 2024-10-09",
    "cover_url": "https://m.media-amazon.com/images/I/51vZ6t5W4gL._SY522_.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "I had picked up murakami’s kafka on the shore but somehow got into this book and boy is it interesting. I read the first 50-60 pages in one go like it was nothing."
      },
      {
        "component": "paragraph",
        "text": "Took a little wayy too long finishing this. Got distracted by kafka on the shore. The book is a good start for system design, teaches a lot a fundamental concepts about system design. Gets a bit repetitive after some time but that is the nature of the subject as at the lowest level most applications have a very similar setup. "
      },
      {
        "component": "paragraph",
        "text": "would recommend to get more practice of the design thought process. The book is good for learning the concepts but does not provide practice problems. Will find some resource for practice. "
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81a2-bb72-d389f1baac9a",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Never split the difference ",
    "read_date": "2024-01-24 to 2024-05-10",
    "cover_url": "https://imgs.search.brave.com/rmA82LHj7brC-0DOYr-AQuFysKVpAVdK0j-yXj1rVv8/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9pbWFn/ZXMtbmEuc3NsLWlt/YWdlcy1hbWF6b24u/Y29tL2ltYWdlcy9J/Lzgxb1VQRUlmNk9M/LmpwZw",
    "description": [
      {
        "component": "paragraph",
        "text": "Finally finished the book. It is a lot of content to digest tbh but yes very practical and useful insights on human conversations and how real life negotiations are affected by small changes in choice of words and tone of your voice. The concepts of mirroring, rapport building, Starting with a \"No\", open ended questions and making the other party think and think just blew up my mind especially  when they were suported by real life cases. Though a lot of practical knowledge it is waste until not practiced enough as all of it highly depends on the delivery of the person. I would recommend it to anyone who likes to understand the dynamics of deal making and negotiations."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81e3-92f5-cd3740f21586",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Parable of the pipeline ",
    "read_date": "2024-01-19 to 2024-01-20",
    "cover_url": "https://imgs.search.brave.com/kpVEB-UG7ZSqb_mpC2jvdqcYXYCMnrLkWo7_YUFhpzs/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9tLm1l/ZGlhLWFtYXpvbi5j/b20vaW1hZ2VzL0kv/NTFGLXljN2FWRkwu/anBn",
    "description": [
      {
        "component": "paragraph",
        "text": "One go read. Widens your perspective towards passive income aka the pipelines. Was written back in the day when MLM was a thing thus makes the times leverage part kind of irrelevant today but surely puts up a thought in your head about core idea that the time vs work can't be a straight line forever. Ah yes ditched 'The great gatsby' couldn't get past the first chapter tbh."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8126-99eb-e841b4a5f9ba",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Norwegian Wood",
    "read_date": "2023-12-01 to 2024-01-19",
    "cover_url": "https://rukminim2.flixcart.com/image/416/416/ki96c280-0/book/n/h/e/norwegian-wood-original-imafy36nzw3hhrgb.jpeg?q=70",
    "description": [
      {
        "component": "paragraph",
        "text": "If I keep it short <b>\"Love life of a college going unsocial main character who does not know what is he doing with his life.\"</b>"
      },
      {
        "component": "paragraph",
        "text": "Longer version of my review will say that the book is worth a read even if the story isn't moving and the best out there. The way characters are weaved, it is the best I've seen so far. Murakami describes every scene in words so vividly that you start to have a strong visual of the place in your head as if you were there watching everything happen in front of your own eyes. The evening when Watanabe and Midori sat there on the terrace watching a fire in her neighbourhood or when Watanabe visits Naoko in her sanatorium I feel as if these are my own memories. "
      },
      {
        "component": "paragraph",
        "text": "I heard the norwegian wood song by beatles on loop for days:)"
      },
      {
        "component": "paragraph",
        "text": "All in all a good book if you want to feel as if you are living in a story."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81b7-94ea-e4909b2ea207",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Peak",
    "read_date": "2023-09-29 to 2023-10-12",
    "cover_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQWzwPXpgJ8Acq9aH___DNYqo7nQJsaKrLT4g",
    "description": [
      {
        "component": "paragraph",
        "text": "Left it in between as it became repetitive of the same content covered in the beginning. Three of the important learnings I got from the book include "
      },
      {
        "component": "numbered_list_item",
        "text": " Learning happens just beyond the comfort zone you need to push yourself just enough that you are in the state of practice where things are hard but doable for sure."
      },
      {
        "component": "numbered_list_item",
        "text": "No expert does not go by the face value of things what that means is that every expert devises a way of his own slightly tweaked to the defined way to do the thing say for example a chess grand master does not see two three pieces and moves at a time he views the whole board and all the pieces at once and compares them to the situations he had practiced on before called a mental representaion, hope that makes some sense. "
      },
      {
        "component": "numbered_list_item",
        "text": "There is something called deliberate practice to acheive greatness in a particular field, Deliberate practice basically means that you should follow the instructions laid out by the experts of the field and devise your own methods over it while maintaing your practice just beyond the comfort zone it is not the number of hours you put in but it is the amount of effective practice that you put in thus experts are not made in 10000 hours but below or above that number depending on the practice efficiency."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-812b-a1c1-dd9355315328",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "It happens for a reason",
    "read_date": "2023-08-03 to 2023-08-22",
    "cover_url": "https://m.media-amazon.com/images/I/51gk96JiXzL._AC_UF1000,1000_QL80_.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "Good story, Bought it just by the name of Preeti Shenoy and boy was it worth it. Was looking for a story that could grip me to finally finish it(I started a lot of fictions but never finished them:{) and this was the one after a long time"
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8112-b8df-d37b518f3cbc",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Psycho-Cybernetics",
    "read_date": "2023-07-30 to 2023-08-23",
    "cover_url": "https://m.media-amazon.com/images/I/41uiX93jl8L._SX309_BO1,204,203,200_.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "Discontinued Reading it mid way. Will finish one day."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-81e4-8a78-f98f60e67924",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Let's Talk Money",
    "read_date": "2023-06-02 to 2023-06-29",
    "cover_url": "https://m.media-amazon.com/images/I/51YJ9xQuWfS._SX324_BO1,204,203,200_.jpg",
    "description": [
      {
        "component": "paragraph",
        "text": "Was suggested by some random youtube video and boy was this book a good one. It is a goldmine, I'd have to come back to this again and again. Must read if you want to learn about personal finance."
      }
    ]
  },
  {
    "id": "1e7e9933-5fca-8174-82e8-c7238f925442",
    "created_time": "2025-05-02T13:59:00.000Z",
    "book_name": "Doglapan",
    "read_date": "2023-06-01 to 2023-07-01",
    "cover_url": "https://rukminim2.flixcart.com/image/416/416/xif0q/book/l/o/t/doglapan-original-imagmxk5qzfebqwj.jpeg?q=70",
    "description": [
      {
        "component": "paragraph",
        "text": "Stumbled on this as an accident but it was a nice journey. Had me learn a lot about behind the scenes of indian startups."
      }
    ]
  }
]