[{"project_name":"RtPDC","date":"Jan 2024 - May 2024","github":"Private Repository","description":"This project is a group project I made under IIT Ropar as a development engineering project. We created a windows application using c++ that establishes TCP connection with multiple PMUs(electrical measurment devices communicating on the local network) and parses there data using the IEEE PC37.118.2/D4.0 after parsing the data from all these PMUs it is sorted according to their timestamps and stored in a MySQL server. Each PMU connection is provided its own thread and there are two threads for sorting and storing the data in the database. All the threads synchronised to avoid race conditions. The Project tries to Improve upon the pitfalls of the depreceated linux application iPDC developed by IITB students in 2012 or around that time."},{"project_name":"PreactJS","date":"Jan 2023 - present","github":"https://github.com/Arpit078/preactjs","description":"A custom Javascript library for making single page web applications. Features include component based architecture of the application, browser window api access, one time call on server for\nstatic objects and hash routing. Routes are automatically generated using the naming convention of folders and files by the build command. Instead of hooks/states like React.js, dynamic script file injection is used to follow build pattern of no JS framework/library applications. Ships with a build command and a live server. Hosted as a npm package with 500+ all time downloads."},{"project_name":"Spot-Down","date":"March 2023","github":"https://github.com/arpit078/spot-down","description":"A file server that can enlist songs from a public spotify playlist and download them on the local storage. The web server lists all the songs in the playlist using spotify api and queries them with youtube search using youtube data\napi. The songs are then downloaded on the server using yt-dlp and a bash script. The complete folder is zipped synchronously\nand is sent to the client."},{"project_name":"ColMail ","date":"June 2023","github":"https://github.com/arpit078/colmail","description":"A personalised cold/bulk emailing cross platform desktop application using Gmail api and Electron.js"},{"project_name":"Resume Builder","date":"July 2023","github":"https://github.com/arpit078/resume-builder","description":"A nodejs script to automate the boring process of updating your resume in latex format everytime you log in your pc . User has to update a google sheet and the program just fills in the corresponding details into a latex template and and updates the resume in pdf."},{"project_name":"InstaPost","date":"Feb 2023","github":"https://github.com/Arpit078/instaPost","description":"puppeteer.js app that can be used in automating instagram posts. Since Instagram does not provide any API for account management this script script comes in handy for posting computer generated posts on a regular time interval helping with consistnency in posting which might increase account reach."},{"project_name":"Stories","date":"Jan 2023","github":"https://github.com/Arpit078/stories","live":"https://Arpit078.github.io/stories","description":"wanted to read some premchand stories on my phone but all websites sucked and i've got no kindle!"}]